ff_benchmarking/ff_dl/backGround/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    AMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    AMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }

    wing
    {
        type            zeroGradient;
    }

    farField
    {
        type            fixedValue;
        value           $internalField;
    }

}

// ************************************************************************* //
